[{
        "name": "Chocolate Brownie",
        "ingredients": "for 9 servings 8 oz good-quality chocolate (225 g), semi-sweet 12 tablespoons butter, melted 1 ¼ cups sugar (250 g) 2 eggs 2 teaspoons vanilla extract ¾ cup all-purpose flour (95 g) ¼ cup cocoa powder (30 g) 1 teaspoon salt",
        "preperation": "Preheat the oven to 350°F (180°C). 2. Line an 8-inch (20 cm) square baking dish with parchment paper. Chop the chocolate into chunks. Melt half of the chocolate in the microwave in 20-second intervals, saving the other half for later. 3. In a large bowl, mix the butter and sugar with an electric hand mixer, then beat in the eggs and vanilla for 1-2 minutes, until the mixture becomes fluffy and light in color. 4. Whisk in the melted chocolate (make sure it's not too hot or else the eggs will cook), then sift in the flour, cocoa powder, and salt. Fold to incorporate the dry ingredients, being careful not to overmix as this will cause the brownies to be more cake-like in texture. 5. Fold in the chocolate chunks, then transfer the batter to the prepared baking dish. 6. Bake for 20-25 minutes, depending on how fudgy you like your brownies, then cool completely. 7. Slice, then serve with a nice cold glass of milk! 8. Enjoy!",
        "image_source": "../static/img/brownie.jpg",
        "url": "brownie"
    },

    {
        "name": "American Banana Split",
        "ingredients": "1 banana, split lengthwise 1 scoop vanilla ice cream 1 scoop chocolate ice cream 1 scoop strawberry ice cream Chocolate syrup, garnish Marshmallow creme, garnish Whipped cream, garnish Chopped lightly toasted nuts, garnish 3 maraschino cherries",
        "preperation": "Peel the banana and slice it in half lengthwise. 2. Place the banana slices against the sides of a long, narrow, shallow dish. 3. Place the scoops of ice cream in a row between the banana slices. 4. Squirt the chocolate syrup on the vanilla and strawberry ice cream. 5. Spoon the marshmallow creme over the chocolate ice cream. 6. Top everything with the whipped cream. 7. Sprinkle it all with nuts and top each mound of ice cream with a cherry.",
        "image_source": "../static/img/banana.jpeg",
        "url": "banana-split"
    },

    {
        "name": "Chocolate Mousse",
        "ingredients": "150g 70% dark chocolate, plus extra to serve 6 egg whites 2 tbsp golden caster sugar 4 tbsp crème fraîche and grated chocolate, to serve",
        "preperation": "Melt the chocolate in the microwave in a microwaveable bowl, stirring every 30 seconds until just melted. Whisk the egg whites to soft peaks, scatter in the sugar and whisk again until the mixture forms stiff peaks when you lift the whisk out (around 30 seconds). 2.Add a big tablespoon of the egg white to the melted chocolate and mix vigorously, working fast so the chocolate doesn’t cool and harden. Then fold in the remaining egg whites carefully using a spatula or large metal spoon. Spoon into 4 glasses or ramekins and set in the fridge for 2-3 hours. Serve each with a dollop of crème fraiche and shavings of dark chocolate.",
        "image_source": "../static/img/chocolatemousse.jpeg",
        "url": "chocolate-mousse"
    },

    {
        "name": "Dominos Cookies",
        "ingredients": "1⁄2 cup butter 1⁄2 cup granulated sugar 1⁄2 cup brown sugar, packed 1 teaspoon vanilla 1⁄2 teaspoon salt 1⁄2 cup Dutch-processed cocoa powder 1⁄3 cup water 1 teaspoon baking soda 1 1⁄4 cups flour 1 cup white chocolate chips 1 cup semi-sweet chocolate chips",
        "preperation": "Preheat oven to 325°F. 2. Cream together butter, sugars, vanilla and salt. 3. Beat in cocoa powder. 4. Dissolve baking soda in water and mix into dough. 5. Stir in flour, and then chips. 6. Place dough by spoonful on a greased baking sheet. 7. Bake for 14 to 16 minutes. (Do not overbake! Cookies will seem a bit underdone when they should come out of the oven - this keeps them from drying out).",
        "image_source": "../static/img/dominos_cookies.jpeg",
        "url": "dominos-cookies"
    },

    {
        "name": "Chocolate Milkshake",
        "ingredients": "3/4 cup milk 1/4 cup chocolate mooju 3 scoops of vanilla ice cream",
        "preperation": "Pour milk & ice cream into blender. 2. Cover and blend until the shake has a thick texture. 3. Pour into glass & enjoy",
        "image_source": "../static/img/milkshake.jpg",
        "url": "milkshake"
    },

    

    {
        "name": "Stacked Waffles",
        "ingredients": "3 cups all-purpose flour 3 tablespoons sugar 2 teaspoon baking powder 1/2 teaspoon baking soda 1/2 teaspoon salt 1/2 teaspoon ground cinnamon Pinch of nutmeg 1 1/2 cup milk 3 ripe bananas, mashed (about 1 cup) 3 large eggs 1/3 cup oil 1 1/2 teaspoon vanilla extract Nutella Sauce: 1/2 cup of Nutella milk to thin Additional Toppings: Whipped cream & fresh bananas",
        "preperation": "In a large bowl whisk the flour, sugar, baking powder, baking soda, salt, cinnamon and nutmeg together. In a large measuring cup or a medium bowl, (I prefer a nice large measuring cup) mix the milk, bananas, eggs, vegetable oil and vanilla extract. Make a well in the middle of the dry ingredients and pour the wet in. Stir until thoroughly combined. Follow the instructions of your specific waffle maker (eg, batter amount & time) to make the waffles. To make the Nutella Sauce, take the Nutella and warm it in a glass measuring cup in the microwave until it's heated up and thinner. Whisk in enough milk until it's thin enough to drizzle over the top of the pancakes.Top with slices of fresh bananas, whipped cream and the Nutella sauce.",
        "image_source": "../static/img/waffles.jpeg",
        "url": "waffles"
    }
]